Revit 2027 API
PlanTopology.GetRoomIds Method
Retrieves room ElementIds of the PlanTopology in the last phase.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetRoomIds()
Public Function GetRoomIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetRoomIds()
member GetRoomIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The PlanTopology Room ElementIds of the last phase.
Remarks
The Rooms Ids returned are in the phase of PlanTopology and the current design option.
See Also
Reference
PlanTopology Class
Autodesk.Revit.DB Namespace